[
    {
      "title": "Deep Learning for Multimodal Portifolio intergrated in Django web application.",
      "image": "images/multimodel-portifolio-1.jpg",
      "description": "The Deep Learning Model Integration project is a comprehensive web application built on the Django framework, incorporating various deep learning models for prediction and Analysis. It serves as a versatile platform for experimenting with and evaluating different types of neural networks, including Simple Artificial Neural Networks (ANN), Convolutional Neural Networks (CNN), VGG16, Recurrent Neural Networks (RNN), Long Short-Term Memory (LSTM) networks, Bidirectional RNN (BiRNN), and Gated Recurrent Units (GRU).",
      "testLink": "#",
      "repositoryLink": "#",
      "backendDocsLink": "#"
    },
    {
      "title": "E-commerce API with Django Rest Framework and Stripe Payment Integration",
      "image": "images/ecommerce-image-1.jpeg",
      "description": "E-commerce API built with Django Rest Framework provides a robust backend solution for online stores, enabling seamless management of products, orders, customers, and payments. Leveraging the power and flexibility of Django Rest Framework, coupled with the secure and feature-rich Stripe Payment API integration, our solution empowers businesses to create scalable and efficient e-commerce platforms.",
      "testLink": "https://green-kitchen.netlify.app/",
      "repositoryLink": "https://github.com/usanaphtal112/green-kitchen-bn",
      "backendDocsLink": "https://greenkitchen.vercel.app/api/v1/api-docs/"
    },
    {
      "title": "Task Management System",
      "image": "images/Task_Management.png",
      "description": " a comprehensive web application designed to streamline and optimize task organization, delegation, and tracking within teams or individual workflows. Leveraging the powerful combination of Django Rest Framework (DRF) for the backend API and React for the frontend, this project offers a seamless user experience with robust functionality.",
      "testLink": "https://workflowtaskmanagement.netlify.app/",
      "repositoryLink": "https://github.com/usanaphtal112/Task-management/",
      "backendDocsLink": "https://naphtal.pythonanywhere.com/api/v1/task-management-documentation/swagger-ui/"
    },
    {
      "title": "Face Recognition System",
      "image": "images/face-recognition-img.jpg",
      "description": "The Face Recognition System is an innovative software solution designed to identify and verify individuals based on their facial features. Leveraging state-of-the-art deep learning algorithms and computer vision techniques, this project offers accurate and reliable facial recognition capabilities for various applications, including security systems, access control, attendance tracking, and personalized user experiences.",
      "testLink": "#",
      "repositoryLink": "#",
      "backendDocsLink": "#"
    },
    {
      "title": "Data Analysis - COVID-19 Analysis Report",
      "image": "images/covid-19-analysis-report.png",
      "description": "The COVID-19 Analysis Report project is a comprehensive data analysis platform aimed at providing insights into the global COVID-19 pandemic. By aggregating and analyzing data from various reliable sources, this project aims to facilitate informed decision-making, track trends, and assess the impact of the pandemic on different regions and demographics.",
      "testLink": "#",
      "repositoryLink": "#",
      "backendDocsLink": "#"
    }
  ]
